Revit 2026 API

# SolidOrShellTessellationControlsAccuracy Property

---

A positive real number specifying how accurately a triangulation should approximate a solid or shell.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Accuracy { get; set; }
```
```vb
Public Property Accuracy As Double
	Get
	Set
```
```cpp
public:
property double Accuracy {
	double get ();
	void set (double value);
}
```
```fsharp
member Accuracy : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The given value for accuracy must be greater than 0 and no more than 30000 feet. |

The maximum distance from a point on the triangulation to the nearest point on the solid or shell should be no greater than the specified accuracy. This constraint may be approximately enforced.

#### Reference

SolidOrShellTessellationControls Class

Autodesk.Revit.DB Namespace